{
  "id": "lin_chih_chu_memorial_hall",
  "image": "data/thumbs/lin_chih_chu.png",
  "name": "Lin Chih-chu Memorial Hall",
  "location": "Taichung City, Taiwan (R.O.C.)",
  "era": "1941 (established), opened to public 2015",
  "style": "Japanese official residence",
  "materials": ["wood", "traditional Japanese architecture materials"],
  "elements": ["single-story residence layout", "wooden structures", "guest studio", "workspaces"],
  "massing": "low, compact single-story structure with a garden setting",
  "structure": "wooden construction typical of Japanese styles of the early 20th century",
  "is_elliptical": false,
  "tiers": 1,
  "has_dome": false,
  "condition": "restored and maintained historic building",
  "intro": "Former faculty dormitory turned studio and residence of artist Lin Chih-chu, now a memorial hall.",
  "history": "Built in 1941 as a faculty dormitory of National Taichung University of Education; became Lin’s studio and home for sixty years; designated a historic monument in 2007; opened to the public in 2015 as the Memorial Hall. ",
  "narrative": {
    "p1": "The building, constructed in 1941, originally served as a faculty dormitory for the National Taichung University of Education. After WWII, Lin Chih-chu transformed it into his studio and residence for six decades.",
    "p2": "In 2007, it was designated as a historic monument by Taichung’s Cultural Affairs Bureau. Following renovation, it opened as a public memorial hall in 2015, preserving the space where the artist worked and lived gallery-style.",
    "p3": "Visitors step into a preserved Japanese-style home filled with atmosphere: wooden floors, personal studio artifacts—pigments, glue, brushes—invoking the creative environment of Lin Chih-chu. The modest structure resonates with the quiet influence of the 'Father of Taiwanese Gouache Painting.'"
  },
  "info": "Lin Chih-chu Memorial Hall (林之助紀念館) is a Japanese-style wooden residence in Taichung, built in 1928 as a teacher’s dormitory beside Liuchuan River. Lin Chih-chu, known as the Father of Taiwanese Gouache Painting, lived and worked here for sixty years from 1946. In 2007, it was designated a historic building and later restored, reopening to the public in 2015. Inside, visitors find preserved wooden architecture, tatami rooms, Lin’s personal painting tools, and exhibitions on gouache art. Exhibits include his pigments, brushes, and furniture, giving insight into his daily creative environment. The hall hosts cultural programs and connects community life with Taiwan’s art history.Lin Chih-chu (林之助, 1917–2008) was born in Taichung. He studied at the Imperial Art School in Japan under masters Okumura Togyu and Yamaguchi Hoshun. At age 24, his painting 'Morning Cool' was selected into Japan’s Imperial Year 2600 Exhibition. Returning to Taiwan in 1941, he taught at Taichung Normal School and became a key art educator. He pioneered gouache painting in Taiwan, blending Western realism with traditional Nihonga influences. In the 1950s he focused on landscapes and bird-and-flower painting. He co-founded art societies and in 1981 established the Taiwan Provincial Gouache Association, serving as chairman. In 2015, 'Morning Cool' was designated a national cultural artifact. Lin passed away in 2008 in Los Angeles, but his legacy continues through his works and the memorial hall, which symbolizes his contribution to Taiwanese art and education.",
  
  "last_verified": "2025-09-06",
  "interiors": [
     {
      "image": "data/interior_images/lin_chih_chu_memorial_hall/lin_chi_chu4.jpg",
      "caption": "Exhibit Room / 展厅"
    },
     {
      "image": "data/interior_images/lin_chih_chu_memorial_hall/lin_chih_1.jpeg",
      "caption": "Hall Exterior / 外观"
    },
     {
      "image": "data/interior_images/lin_chih_chu_memorial_hall/lin_chu2.jpeg",
      "caption": "Wooden Design / 木结构"
    },
    {
      "image": "data/interior_images/lin_chih_chu_memorial_hall/inside_view.png",
      "caption": "Inside View / 内部视图"
    },
    {
      "image": "data/interior_images/lin_chih_chu_memorial_hall/living.jpeg",
      "caption": "Living space of Lin Chih-chu / 居住空间"
    },
    {
      "image": "data/interior_images/lin_chih_chu_memorial_hall/tree_.jpeg",
      "caption": "Memorial hall in harmony with nature / 与自然和谐相处的纪念馆"
    }
  ]
}
